#include<iostream>
#include<Windows.h>
#include<conio.h>
#include <time.h>
#include <string>
using namespace std;
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------
#define BASCET_CENTR 220   // 
#define BASCET_LEFT 222    // Вид рисунка корзины
#define BASCET_RIGHT 221   //
//_________________________________________________________________________________________________________________________________________________________________
#define LINELONG_V 23      // Длинна рамки по вертикали
#define LINE_SLONG_G 13  // Длинна короткой вертикальной линии
#define LINELONG_G 38      // Длинна рамки по горизонтали
//_________________________________________________________________________________________________________________________________________________________________
#define LEFTUP_X 2         // Начальная точка ЛЕВОЙ линии по Х
#define LEFTUP_Y 2         // Начальная точка ЛЕВОЙ линии по Y
//_________________________________________________________________________________________________________________________________________________________________
#define LEFTDOWN_X 2       // Начальная точка ВЕРТИКАЛЬНОЙ линии по Х
#define LEFTDOWN_Y 23      // Начальная точка ВЕРТИКАЛЬНОЙ линии по Y
//_________________________________________________________________________________________________________________________________________________________________
#define RIGHTUP_X 39       // Начальная точка ПРАВОЙ линии по Х
#define RIGHTUP_Y 3        // Начальная точка ПРАВОЙ линии по Y
//_________________________________________________________________________________________________________________________________________________________________
#define POINT_PO_AZ_X 3     // Координата Х для левых линий
#define POINT_PO_KM_X 26   // Координата Х для правых линий
#define POINT_PO_AK_Y 9   // Координата Y для верхних линий
#define POINT_PO_ZM_Y 13   // Координата Y для нижних линий
//_________________________________________________________________________________________________________________________________________________________________
#define VERTICALLINE 179   // Вид рисунка горизонтальной линии
#define GORIZONTLINE '*'  // Вид рисунка вертикальной линии
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------
class NuPogodi
{
public:
	NuPogodi();
	~NuPogodi();
	//_____________________________________________________________________________________________________________________________________________________________
	void ShiftCursor (short X,short Y); // Функция координат
	void Fild (); // Функция отрисовующая игровое полe
	void Vertical_Line(int LineBegin_X, int LineBegin_Y,int LineLong, char VerLine); // Функция отрисовующая горизонтальные линии игрового поля
	void Gorizont_Line(int LineBegin_X, int LineBegin_Y,int LineLong, char GorLine); // Функция отрисовующая вертикальные линии игрового поля
	void BasketPaint (int BasClearX, int BasPaintX,int BasClearY, int BasPaintY, char BascetCentr, char BascetLeft, char BascetRight); // Функция игровой корзинки
	//_____________________________________________________________________________________________________________________________________________________________
	void SetX (int x);
	void SetY (int y);
	void Set_X (int _x);
	void Set_Y (int _y);
	void SetRand_X (int Rand_x);
	void SetRand_Y (int Rand_y);
	void SetTemp (int Temp);
	void SetSpeed (int Speed);
	void SetRahunok (int Rahunok);
	void SetDead (int Dead);
	void SetAces (int Aces);
	void SetBest_score (int Best_score);
	void SetKey (int Key);
	void SetBCX (int BCX);
	void SetBPX (int BPX);
	void SetBCY (int BCY);
	void SetBPY (int BPY);
	//_____________________________________________________________________________________________________________________________________________________________
	int GetX ();
	int GetY ();
	int Get_X ();
	int Get_Y ();
	int GetRand_X ();
	int GetRand_Y ();
	int GetBest_score ();
	int GetRahunok ();
	int GetDead ();
	int GetAces ();
	int GetTemp ();
	int GetSpeed ();
	int GetKey ();
	int GetBCX ();
	int GetBPX ();
	int GetBCY ();
	int GetBPY ();
	//_____________________________________________________________________________________________________________________________________________________________
	void Pozishion (int Key);
	//_____________________________________________________________________________________________________________________________________________________________
	void BeginningData ();
	//_____________________________________________________________________________________________________________________________________________________________
	void BallHit ();
	//_____________________________________________________________________________________________________________________________________________________________
	void BallMuve ();

private:
	int x;                            //
	int y;                           //Координата яблока отрисовка
	//_____________________________________________________________________________________________________________________________________________________________
	int _x;                        //
	int _y;                       //Координата яблоко затирка
	//_____________________________________________________________________________________________________________________________________________________________
	int Rand_x;                 // Случайный Х
	int Rand_y;                // Случайный Y
	//_____________________________________________________________________________________________________________________________________________________________
	int Temp;                //Координата для определения скорости
	//_____________________________________________________________________________________________________________________________________________________________
	int Speed;             //Координата для задания скорости
	//_____________________________________________________________________________________________________________________________________________________________
	int Rahunok;         //Счет
	//_____________________________________________________________________________________________________________________________________________________________
	int Dead;          //Жизни
	//_____________________________________________________________________________________________________________________________________________________________
	int Aces;        //Ускорение
	//_____________________________________________________________________________________________________________________________________________________________
	int Best_score;// Лутший счет
	//-------------------------------------------------------------------------------------------------------------------------------------------------------------
	int Key;     //Переменная для сохранения нажатой клавиши "P"
	int BCX;	//Для сохранения координаты Х очистки
	int BPX;   //Перемення для сохранения Х координаты рисования 
	int BCY;  //Для сохранения координаты Y очистки
	int BPY; //Перемення для сохранения Y координаты рисования 
	
};